In [ ]:
[x * 3 for x in [1, 2, 3]]

In [ ]:
list(map(lambda x: x, [1, 2, 3]))

In [ ]:
map(lambda x: x, [1, 2, 3])

In [ ]:
list(map(lambda x: str(x), filter(lambda x: x > 1, [1, 2, 3])))

In [11]:
print("Hi")

Hi

In [12]:
import pandas as pd

In [13]:
pd

In [14]:
data = {
    'Name':['Angela','Angela', 'Daniel', 'Daniel', 'Marko', 'Marko'],
    'Age':[25, 31, 33, 33, 30, 32]
}

In [16]:
data

{'Name': ['Angela', 'Angela', 'Daniel', 'Daniel', 'Marko', 'Marko'],
 'Age': [25, 31, 33, 33, 30, 32]}

In [26]:
df = pd.DataFrame(data)

In [18]:
df

     Name  Age
0  Angela   25
1  Angela   31
2  Daniel   33
3  Daniel   33
4   Marko   30
5   Marko   32

In [21]:
df['Name']

0    Angela
1    Daniel
2     Marko
3     Marko
Name: Name, dtype: object

In [22]:
df['Age']

0    25
1    33
2    30
3    32
Name: Age, dtype: int64

In [23]:
filter_ = df['Age'] >= 30

In [24]:
df[filter_]

     Name  Age
1  Daniel   33
2   Marko   30
3   Marko   32

In [25]:
df

     Name  Age
0  Angela   25
1  Daniel   33
2   Marko   30
3   Marko   32

In [30]:
df.groupby('Name').agg(
    {
        "Age":"mean"
    }
)

         Age
Name
Angela  28.0
Daniel  33.0
Marko   31.0

In [32]:
g = df.groupby('Name').agg(
    {
        "Age":"max"
    }
)

In [33]:
g

        Age
Name
Angela   31
Daniel   33
Marko    32

In [34]:
g.index

Index(['Angela', 'Daniel', 'Marko'], dtype='object', name='Name')

In [35]:
df

     Name  Age
0  Angela   25
1  Angela   31
2  Daniel   33
3   Marko   30
4   Marko   32

In [36]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [37]:
g.reset_index()

     Name  Age
0  Angela   31
1  Daniel   33
2   Marko   32

In [42]:
df

     Name  Age
0  Angela   25
1  Angela   31
2  Daniel   33
3  Daniel   33
4   Marko   30
5   Marko   32

In [48]:
df.drop_duplicates().reset_index()

   index    Name  Age
0      0  Angela   25
1      1  Angela   31
2      2  Daniel   33
3      4   Marko   30
4      5   Marko   32

In [49]:
df.drop_duplicates().reset_index(drop=True)

     Name  Age
0  Angela   25
1  Angela   31
2  Daniel   33
3   Marko   30
4   Marko   32

In [19]:
# Creating a DataFrame from a Dictionary
import pandas as pd

In [78]:
data1 = {'Name':['John','Alice','Bob','Marko','Charlie'],
        'Age':[25, 28, 22, 30, 27],
        'City': ['New York','Los Angeles','Seattle','San Francisco', 'New Jersey'],
         'Salary':[50000, 20000, 60000, 45000, 'Null']
}

In [79]:
df = pd.DataFrame(data1)

In [80]:
data1

{'Name': ['John', 'Alice', 'Bob', 'Marko', 'Charlie'],
 'Age': [25, 28, 22, 30, 27],
 'City': ['New York', 'Los Angeles', 'Seattle', 'San Francisco', 'New Jersey'],
 'Salary': [50000, 20000, 60000, 45000, 'Null']}

In [31]:
df

    Name  Age           City
0   John   25       New York
1  Alice   28  San Francisco
2    Bob   22        Seattle
3  Marko   30  San Francisco

In [33]:
# Accessing Data
# Accessing a specific column
df['Name']

0     John
1    Alice
2      Bob
3    Marko
Name: Name, dtype: object

In [34]:
# Slicing Rows
df[1:3]

    Name  Age           City
1  Alice   28  San Francisco
2    Bob   22        Seattle

In [35]:
# Manipulating Data
# Adding new Column
df['Salary'] = [50000, 60000, 20000, 30000]

In [36]:
df

    Name  Age           City  Salary
0   John   25       New York   50000
1  Alice   28  San Francisco   60000
2    Bob   22        Seattle   20000
3  Marko   30  San Francisco   30000

In [37]:
# Filtering Rows
df['Age'] < 25

0    False
1    False
2     True
3    False
Name: Age, dtype: bool

In [38]:
df[df['Age'] < 25]

  Name  Age     City  Salary
2  Bob   22  Seattle   20000

In [39]:
# Pandas Series
# Creating a Series from a list
ages = pd.Series([25, 28, 22], name = 'Age')

In [41]:
# Accessing & Manipulating
ages[0] # Accessing elements by index

25

In [44]:
ages.apply(lambda x: x * 12)

0    300
1    336
2    264
Name: Age, dtype: int64

In [46]:
ages

0    25
1    28
2    22
Name: Age, dtype: int64

In [53]:
df.groupby('Name').agg({'Age':'mean'})

        Age
Name
Alice  28.0
Bob    22.0
John   25.0
Marko  30.0

In [54]:
# Filtering in Pandas
# Basic Filtering 
young_employees = df[df['Age'] < 30] # Filtering based on Age

In [56]:
young_employees

    Name  Age           City  Salary
0   John   25       New York   50000
1  Alice   28  San Francisco   60000
2    Bob   22        Seattle   20000

In [57]:
# Advance Filtering 
# Logical Operators AND (&), OR (|), NOT (~)
young_high_earners = df[(df['Age'] < 30) & (df['Salary'] > 55000)]

In [58]:
young_high_earners

    Name  Age           City  Salary
1  Alice   28  San Francisco   60000

In [62]:
# Using isin() method
# Filtering based on a list of names
selected_names = df[df['Name'].isin(['Alice', 'Marko'])]

In [63]:
selected_names

    Name  Age           City  Salary
1  Alice   28  San Francisco   60000
3  Marko   30  San Francisco   30000

In [61]:
df

    Name  Age           City  Salary
0   John   25       New York   50000
1  Alice   28  San Francisco   60000
2    Bob   22        Seattle   20000
3  Marko   30  San Francisco   30000

In [64]:
# String Methods
# Filtering based on City starting with 'S'
a_city = df[df['City'].str.startswith('S')]

In [65]:
a_city

    Name  Age           City  Salary
1  Alice   28  San Francisco   60000
2    Bob   22        Seattle   20000
3  Marko   30  San Francisco   30000

In [70]:
# Filtering Null
# Filtering rows with null values in the Salary Column
new_data = {'Name':'Angela','Age':29,'City':'Los Angeles','Salary':55000}

In [81]:
df

      Name  Age           City Salary
0     John   25       New York  50000
1    Alice   28    Los Angeles  20000
2      Bob   22        Seattle  60000
3    Marko   30  San Francisco  45000
4  Charlie   27     New Jersey   Null

In [82]:
non_null_salaries = df[df['Salary'].notnull()]

In [83]:
non_null_salaries

      Name  Age           City Salary
0     John   25       New York  50000
1    Alice   28    Los Angeles  20000
2      Bob   22        Seattle  60000
3    Marko   30  San Francisco  45000
4  Charlie   27     New Jersey   Null